# pymysql
- 파이썬에서 MySQL, MariaDB DBMS와 연동하는 다양한 함수를 제공하는 모듈
- Python [DB API 2.0](http://www.python.org/dev/peps/pep-0249) 표준을 따른다.
- https://github.com/PyMySQL/PyMySQL/
- https://pymysql.readthedocs.io/en/latest/

# 설치
- 조건
    - python version 3.6 이상
    - mysql version 5.6 이상
- 설치
    - `pip install PyMySQL`
    - `conda install -c conda-forge pymysql`

In [5]:
!python -m pip install --upgrade pip

Requirement already satisfied: pip in /Users/don/opt/anaconda3/lib/python3.9/site-packages (22.1)
Collecting pip
  Downloading pip-22.1.2-py3-none-any.whl (2.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 26.2 MB/s eta 0:00:0000:0100:01
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 22.1
    Uninstalling pip-22.1:
      Successfully uninstalled pip-22.1
Successfully installed pip-22.1.2

In [6]:
!pip install PyMySQL

Requirement already satisfied: PyMySQL in /Users/don/opt/anaconda3/lib/python3.9/site-packages (1.0.2)

# 기본 작성 절차

1. Database 연결
    ```python
       connection =  pymysql.connect(host="DBMS 서버 ip", 
                                     port="port번호", 
                                     user="계정명", 
                                     password="비밀번호", 
                                     db="연결할데이터베이스이름", 
                                     charset='utf8')
    ```
    - port 번호 기본값: 3306
2. Connection을 이용해 Cursor 생성
    - Cursor: 연결된 Database에 sql문을 전송하고 select결과 조회 기능을 제공하는 객체
    ```python
        cursor = connection.cursor()
    ```
3. Cusror를 이용해 SQL문 전송
    ```python
        cursor.execute("sql문")
    ```
4. 연결 닫기
    - cursor, connection 연결을 닫는다.
    - with문을 이용할 수 있다. 
    ```python
    cursor.close()
    connection.close()
    ```

# 예제

## 테이블 생성
- 참고) pymysql을 이용해서는 DML(insert, update, delete, update)문을 실행한다. (DDL은 거의 실행하지 않는다.)

In [7]:
# import
import pymysql

# DB 연결 - connect()
connection = pymysql.connect(host = '127.0.0.1',
                             port = 3306,
                             user = 'scott',
                             password = 'tiger',
                             db = 'testdb')
print(type(connection))

<class 'pymysql.connections.Connection'>

In [8]:
# Cursor를 Connection으로 부터 얻어온다 - Cursor: sql문 실행을 관리하는 객체.
cursor = connection.cursor()
print(type(cursor))

<class 'pymysql.cursors.Cursor'>

In [12]:
# sql 문 실행
# sql ansdms string을 정의. execute() 메소드를 이용해서 DB에 전송
sql = """
create table test_user(
 id int auto_increment primary key,
 name varchar(30) not null,
 email varchar(100) not null unique,
 tall decimal(5,2),
 birthday date
)
"""
cursor.execute(sql)  # 실행

0

In [13]:
# 연결 닫기 - cursor, connection close
cursor.close()
connection.close()

## DML
### insert

In [34]:
import pymysql # auto commit = False
sql = "insert into test_user(name, email, tall, birthday) values ('홍길동', 'hong@a.com', 182.23, '2000-02-03')"
try:
    connection = pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb',charset='utf8')
    # cursor 생성
    cursor = connection.cursor()
    # insert문 실행
    cnt = cursor.execute(sql)
    print(f"{cnt}행이 insert되었습니다.")
    connection.commit() # insert/delete/update 문 실행 후 commit 처리를 해야한다
except Exception as e:
    if connection:
        connection.rollback()
    print(e)
finally:
    if cursor:
        cursor.close()
    if connection:
        connection.close()

1행이 insert되었습니다.

In [22]:
# with 문
sql = "insert into test_user(name, email, tall, birthday) values ('홍길동2', 'hong2@a.com', 182.23, '2000-02-03')"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cnt = cursor.execute(sql)
        print(f'{cnt}행이 insert됨')
        connection.commit()

1행이 insert됨

In [23]:
def insert_user(name, email, tall, birthday):
    sql = f"insert into test_user(name, email, tall, birthday) values ('{name}', '{email}', {tall}, '{birthday}')"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql)
            print(f'{cnt}행이 insert됨')
            connection.commit()

In [24]:
insert_user('이순신', 'lee@a.com', 190.20, '1995-10-22')

1행이 insert됨

### Parameterized Query
- Parameterized Query
    - SQL 문에서 컬럼 값이 들어가는 자리에 값대신 `%s` placeholder를 사용한뒤 execute()에서 placeholder에 넣을 값을 tuple로 제공한다.
    - query문을 쉽게 작성할 수 있는 장점이 있다.

In [27]:
date(1999,3,2) # sql date

datetime.date(1999, 3, 2)

In [31]:
# datatime 모듈: 날짜-date, 시간-time, 날짜시간-datetime 등 날짜와 시간을 다루는 모듈. => DB의 날짜/시간 타입과 연동.
from datetime import date
sql = "insert into test_user(name, email, tall, birthday) values (%s, %s, %s, %s)"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cnt = cursor.execute(sql, ('유관순', 'yoo2@a.com', 175.3, '2000-01-05'))
        cnt2 = cursor.execute(sql, ('강감찬', 'kang@a.com', 170.3, date(1995,2,3)))
        print(f'{cnt}행이 insert됨')
        print(f'{cnt2}행이 insert됨')
        connection.commit()

1행이 insert됨
1행이 insert됨

### Parameterized Query를 이용해 여러개 행 insert

#### for문 사용

In [37]:
names = ['이름1', '이름2', '이름3']
emails = ['e1@a.com','e2@a.com','e3@a.com']
talls = [182.3, 157.3, 175.2]
birthdays = ['2012.2.3',date.today(), '1952-5-3']

In [53]:
sql = "insert into test_user(name, email, tall, birthday) values (%s, %s, %s, %s)"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        for data in zip(names, emails, talls,birthdays):
            cursor.execute(sql,data)
        connection.commit()

IntegrityError: (1062, "Duplicate entry 'e1@a.com' for key 'test_user.email'")

#### executemany() 사용
- insert할 값들을 가진 리스트를 넣어 한번에 여러 행을 insert한다.

In [85]:
datas = [
    ['name1', 'a1@a.com', 172.3, '2002-02-22'],
    ['name2', 'a2@a.com', 145.23, '2001-03-20'],
    ['name3', 'a3@a.com', 178.2, '2015-04-23']
]
# datas = [
#     ['name1', 'a1@a.com', 172.3, '2000-02-22'],
#     ['name2', 'a2@a.com', 182.44, '2001-03-20'],
#     ['name3', 'a3@a.com', 162.44, '2005-03-10'],
# ]
sql = 'insert into test_user(name, email, tall, birthday) values (%s, %s, %s, %s)'
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.executemany(sql, datas)
        connection.commit()

IntegrityError: (1062, "Duplicate entry 'a1@a.com' for key 'test_user.email'")

In [75]:
datas = [
    ['name1', 'a1@a.com', 172.3, '2000-02-22'],
    ['name2', 'a2@a.com', 182.44, '2001-03-20'],
    ['name3', 'a3@a.com', 162.44, '2005-03-10'],
]
sql = 'insert into test_user (name, email, tall, birthday) values (%s, %s, %s, %s)'
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.executemany(sql, datas)
        connection.commit()

IntegrityError: (1062, "Duplicate entry 'a1@a.com' for key 'test_user.email'")

In [57]:
update_sql = "update test_user set tall = tall+10, birthday = '2000-01-01'"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
    with connection.cursor() as cursor:
        cnt = cursor.execute(update_sql)
        connection.commit()
        print(f'{cnt}행이 update됨')

9행이 update됨

### update/delete
- 코딩 절차는 insert 와 동일

In [82]:
def update_user_by_id(id, name, email, tall, birthday):
    update_sql = "update test_user set name=%s, email=%s, tall=%s, birthday=%s where id=%s"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(update_sql, (name, email, tall, birthday, id))
            connection.commit()
            return cnt

In [83]:
update_user_by_id(2, '홍길동', 'honggildong@abc.com', 192.23, '1990-10-10')

0

In [ ]:
def update_user_by_id(id, name, email, tall, birthday):
    update_sql = 'update test_user set name=%s, email=%s, tall=%s, birthday=%s where id=%s'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(update_sql, (name, email, tall, birthday, id))
            connection.commit()
            return cnt

In [ ]:
update_user_by_id(2, '홍길동', 'honggildong@abc.com', 192.23, '1990-10-10')

In [60]:
# delete
delete_sql = "delete from test_user where id =%s"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(delete_sql,(3,))
            print(cnt)
            connection.commit()

1

In [61]:
def delete_user_by_id(id):
    delete_sql = "delete from test_user where id =%s"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
            with connection.cursor() as cursor:
                cnt = cursor.execute(delete_sql,(id,))
                return cnt

In [63]:
delete_user_by_id(4)

1

1

## select (DQL - Data Query Language)
- 조회결과 조회
    - cursor.execute("select문") 실행 후 cursor의 결과 조회 메소드(fetch메소드)를 이용해 결과를 받는다.
- fetch메소드
    - **fetchall()**
        - 조회한 모든 행을을 반환
    - **fetchmany(size=개수)**
        - 지정한 size개수 만큼 반환
    - **fetchone()**
        - 조회결과 중 첫번째 행만 반환
        - 주로 pk 동등 조건으로 조회한 경우 사용

### fetchall()

In [12]:
import pymysql
sql = "select * from test_user"

with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb',charset='utf8') as connection:
    with connection.cursor() as cursor:
#        select문 실행
        print(type(cursor))
        cursor.execute(sql)
#       select 결과 조회 (cursor.fetchxxx()메소드 이용)
        result=cursor.fetchall()

<class 'pymysql.cursors.Cursor'>

In [9]:
print(type(result),len(result))
result

<class 'tuple'> 11

((4, '이순신', 'lee@a.com', Decimal('200.20'), datetime.date(2000, 1, 1)),
 (5, '유관순', 'yoo@a.com', Decimal('185.30'), datetime.date(2000, 1, 1)),
 (10, '유관순', 'yoo2@a.com', Decimal('185.30'), datetime.date(2000, 1, 1)),
 (11, '강감찬', 'kang@a.com', Decimal('180.30'), datetime.date(2000, 1, 1)),
 (14, '홍길동', 'hong@a.com', Decimal('192.23'), datetime.date(2000, 1, 1)),
 (18, '이름1', 'e1@a.com', Decimal('192.30'), datetime.date(2000, 1, 1)),
 (19, '이름2', 'e2@a.com', Decimal('167.30'), datetime.date(2000, 1, 1)),
 (20, '이름3', 'e3@a.com', Decimal('185.20'), datetime.date(2000, 1, 1)),
 (22, 'name1', 'a1@a.com', Decimal('172.30'), datetime.date(2000, 2, 22)),
 (23, 'name2', 'a2@a.com', Decimal('182.44'), datetime.date(2001, 3, 20)),
 (24, 'name3', 'a3@a.com', Decimal('162.44'), datetime.date(2005, 3, 10)))

In [13]:
sql = "select * from test_user"

with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger',db='testdb',charset='utf8',
                    cursorclass=pymysql.cursors.DictCursor) as connection: # 조회결과를 Dictionary로 반환하는 커서
    with connection.cursor() as cursor:
        print(type(cursor))
        cursor.execute(sql)
        result = cursor.fetchall()
print("2번행의 이름",result[1][1])

<class 'pymysql.cursors.DictCursor'>

In [14]:
print(type(result)),len(result)
print(type(result[0])) # dict: key -컬럼명, value- 컬럼값
result

<class 'list'>
<class 'dict'>

[{'id': 4,
  'name': '이순신',
  'email': 'lee@a.com',
  'tall': Decimal('200.20'),
  'birthday': datetime.date(2000, 1, 1)},
 {'id': 5,
  'name': '유관순',
  'email': 'yoo@a.com',
  'tall': Decimal('185.30'),
  'birthday': datetime.date(2000, 1, 1)},
 {'id': 10,
  'name': '유관순',
  'email': 'yoo2@a.com',
  'tall': Decimal('185.30'),
  'birthday': datetime.date(2000, 1, 1)},
 {'id': 11,
  'name': '강감찬',
  'email': 'kang@a.com',
  'tall': Decimal('180.30'),
  'birthday': datetime.date(2000, 1, 1)},
 {'id': 14,
  'name': '홍길동',
  'email': 'hong@a.com',
  'tall': Decimal('192.23'),
  'birthday': datetime.date(2000, 1, 1)},
 {'id': 18,
  'name': '이름1',
  'email': 'e1@a.com',
  'tall': Decimal('192.30'),
  'birthday': datetime.date(2000, 1, 1)},
 {'id': 19,
  'name': '이름2',
  'email': 'e2@a.com',
  'tall': Decimal('167.30'),
  'birthday': datetime.date(2000, 1, 1)},
 {'id': 20,
  'name': '이름3',
  'email': 'e3@a.com',
  'tall': Decimal('185.20'),
  'birthday': datetime.date(2000, 1, 1)},
 {'id': 22,
  'name': 'name1',
  'email': 'a1@a.com',
  'tall': Decimal('172.30'),
  'birthday': datetime.date(2000, 2, 22)},
 {'id': 23,
  'name': 'name2',
  'email': 'a2@a.com',
  'tall': Decimal('182.44'),
  'birthday': datetime.date(2001, 3, 20)},
 {'id': 24,
  'name': 'name3',
  'email': 'a3@a.com',
  'tall': Decimal('162.44'),
  'birthday': datetime.date(2005, 3, 10)}]

In [19]:
sql = "select * from test_user"

with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger',db='testdb',charset='utf8',
                    ) as connection: # 조회결과를 Dictionary로 반환하는 커서
    with connection.cursor() as cursor:
        cursor.execute(sql)
        result = cursor.fetchall()
print(result)
print("2번행의 이름",result[1][1])

((4, '이순신', 'lee@a.com', Decimal('200.20'), datetime.date(2000, 1, 1)), (5, '유관순', 'yoo@a.com', Decimal('185.30'), datetime.date(2000, 1, 1)), (10, '유관순', 'yoo2@a.com', Decimal('185.30'), datetime.date(2000, 1, 1)), (11, '강감찬', 'kang@a.com', Decimal('180.30'), datetime.date(2000, 1, 1)), (14, '홍길동', 'hong@a.com', Decimal('192.23'), datetime.date(2000, 1, 1)), (18, '이름1', 'e1@a.com', Decimal('192.30'), datetime.date(2000, 1, 1)), (19, '이름2', 'e2@a.com', Decimal('167.30'), datetime.date(2000, 1, 1)), (20, '이름3', 'e3@a.com', Decimal('185.20'), datetime.date(2000, 1, 1)), (22, 'name1', 'a1@a.com', Decimal('172.30'), datetime.date(2000, 2, 22)), (23, 'name2', 'a2@a.com', Decimal('182.44'), datetime.date(2001, 3, 20)), (24, 'name3', 'a3@a.com', Decimal('162.44'), datetime.date(2005, 3, 10)))
2번행의 이름 유관순

In [17]:
result[0]['name'], result[0]['email']

('이순신', 'lee@a.com')

### fetchone()

In [15]:
sql = "select * from test_user where id = %s"
# pk로 조회 - 조회결과 0 또는 1행
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb',charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql,(4))  
        result=cursor.fetchone() # 조회결과가 없으면 None 있으면 1개의 데이터 반환 => where에서 pk로 조회할 경우
print(result)

(4, '이순신', 'lee@a.com', Decimal('200.20'), datetime.date(2000, 1, 1))

In [8]:
sql = "select * from test_user"
# pk로 조회 - 조회결과 0 또는 1행
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb',charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql) 
        result=cursor.fetchone() # 여러행이 조회될경우 한행만(첫행만) 반환

### fetchmany()

In [31]:
sql = "select * from test_user"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb',charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql)
        result = cursor.fetchmany(size = 3)

In [28]:
print(len(result))
print(result)

11
((4, '이순신', 'lee@a.com', Decimal('200.20'), datetime.date(2000, 1, 1)), (5, '유관순', 'yoo@a.com', Decimal('185.30'), datetime.date(2000, 1, 1)), (10, '유관순', 'yoo2@a.com', Decimal('185.30'), datetime.date(2000, 1, 1)), (11, '강감찬', 'kang@a.com', Decimal('180.30'), datetime.date(2000, 1, 1)), (14, '홍길동', 'hong@a.com', Decimal('192.23'), datetime.date(2000, 1, 1)), (18, '이름1', 'e1@a.com', Decimal('192.30'), datetime.date(2000, 1, 1)), (19, '이름2', 'e2@a.com', Decimal('167.30'), datetime.date(2000, 1, 1)), (20, '이름3', 'e3@a.com', Decimal('185.20'), datetime.date(2000, 1, 1)), (22, 'name1', 'a1@a.com', Decimal('172.30'), datetime.date(2000, 2, 22)), (23, 'name2', 'a2@a.com', Decimal('182.44'), datetime.date(2001, 3, 20)), (24, 'name3', 'a3@a.com', Decimal('162.44'), datetime.date(2005, 3, 10)))

In [32]:
print(len(result))
print(result)

3
((4, '이순신', 'lee@a.com', Decimal('200.20'), datetime.date(2000, 1, 1)), (5, '유관순', 'yoo@a.com', Decimal('185.30'), datetime.date(2000, 1, 1)), (10, '유관순', 'yoo2@a.com', Decimal('185.30'), datetime.date(2000, 1, 1)))

### cursor 는 iterable 타입
- for문에 select 실행한 cursor를 사용하면 조회결과를 한 행씩 조회할 수 있다.

In [33]:
sql = "select * from test_user"
with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb',charset='utf8') as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql)
        for data in cursor: # 한번 반복시마다 조회결과를 한행씩 반환
            print(data)

(4, '이순신', 'lee@a.com', Decimal('200.20'), datetime.date(2000, 1, 1))
(5, '유관순', 'yoo@a.com', Decimal('185.30'), datetime.date(2000, 1, 1))
(10, '유관순', 'yoo2@a.com', Decimal('185.30'), datetime.date(2000, 1, 1))
(11, '강감찬', 'kang@a.com', Decimal('180.30'), datetime.date(2000, 1, 1))
(14, '홍길동', 'hong@a.com', Decimal('192.23'), datetime.date(2000, 1, 1))
(18, '이름1', 'e1@a.com', Decimal('192.30'), datetime.date(2000, 1, 1))
(19, '이름2', 'e2@a.com', Decimal('167.30'), datetime.date(2000, 1, 1))
(20, '이름3', 'e3@a.com', Decimal('185.20'), datetime.date(2000, 1, 1))
(22, 'name1', 'a1@a.com', Decimal('172.30'), datetime.date(2000, 2, 22))
(23, 'name2', 'a2@a.com', Decimal('182.44'), datetime.date(2001, 3, 20))
(24, 'name3', 'a3@a.com', Decimal('162.44'), datetime.date(2005, 3, 10))

In [ ]:
def insert_user(name, email, tall, birthday):
    sql = f"insert into test_user(name, email, tall, birthday) values ('{name}', '{email}', {tall}, '{birthday}')"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='testdb', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql)
            print(f'{cnt}행이 insert됨')
            connection.commit()

## TODO
- DB:hr (emp 테이블)

In [96]:
# 1개의 행을 emp 테이블에 insert 하는 함수 - 호출해서 값 insert
# Null을 허용하는 컬럼, default값이 있는 컬럼들은 기본값이 있는 매개변수로 선언한다. (null=>None)
def insert_emp(emp_id, emp_name, job, hire_date, mgr_id=None, salary=None, comm_pct=None, dept_name=None):
    sql = 'insert into emp values(%s, %s, %s, %s, %s, %s, %s, %s)'
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql, (emp_id, emp_name, job, mgr_id, hire_date, salary, comm_pct, dept_name))
            print(type(cnt))
            connection.commit()
            return cnt

In [97]:
insert_emp(403, '홍길동', '기획', '2020-10-10', 100, 3000, 0.2, '기획부')

<class 'int'>

1

In [ ]:
# emp 테이블의 데이터를 수정하는 함수 - emp_id(where)로 나머지 정보를 수정

In [62]:
def update_emp(emp_id, emp_name, job, salary, mgr_id, hire_date, comm_pct, dept_name):
    sql = "update emp set emp_name=%s, job=%s, salary=%s, mgr_id=%s, hire_date=%s, comm_pct=%s, dept_name=%s where emp_id = %s"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql, (emp_name, job, salary, mgr_id, hire_date, comm_pct, dept_name, emp_id))
            connection.commit()
            return cnt

In [63]:
# update_emp(206, '윌리암', '회계', '2002-06-07', 205,  18300, None, 'Accounting')
update_emp(206, '월리암', '회계', 18300, 205, '2002-06-07', None, 'Accounting')

1

In [ ]:
# emp_id를 매개변수로 받아서 그 emp_id의 직원 정보를 삭제하는 메소드

In [70]:
def delete_emp(emp_id):
    sql = "delete from emp where emp_id = %s"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql,(emp_id))
            connection.commit()
            return cnt

In [71]:
delete_emp(205)

1

In [ ]:
# job을 매개변수로 받아서 그 job의 직원들을 삭제하는 메소드

In [74]:
def delete_job(job):
    sql = "delete from emp where job = %s"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cnt = cursor.execute(sql,(job))
            connection.commit()
            return cnt

In [75]:
delete_job('PR_REP')

1

In [ ]:
# 전체 직원을 조회한 결과를 반환하는 메소드.

In [87]:
def select_all_emp():
    sql = "select * from emp"
    with pymysql.connect(host='127.0.0.1', port=3306, user='scott', password='tiger', db='hr', charset='utf8') as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql)
            result = cursor.fetchall()
            return result

In [89]:
r= select_all_emp()
print(len(r))
print(r)

109
((100, 'Steven', 'AD_PRES', None, datetime.date(2003, 6, 17), Decimal('24000.00'), None, 'Executive'), (101, 'Neena', 'AD_VP', 100, datetime.date(2005, 9, 21), Decimal('17000.00'), None, 'Executive'), (102, 'Lex', 'AD_VP', 100, datetime.date(2001, 1, 13), Decimal('17000.00'), None, 'Executive'), (103, 'Alexander', 'IT_PROG', 102, datetime.date(2006, 1, 3), Decimal('9000.00'), None, 'IT'), (104, 'Bruce', 'IT_PROG', 103, datetime.date(2007, 5, 21), Decimal('6000.00'), None, 'IT'), (105, 'David', 'IT_PROG', 103, datetime.date(2005, 6, 25), Decimal('4800.00'), None, 'IT'), (106, 'Valli', 'IT_PROG', 103, datetime.date(2006, 2, 5), Decimal('4800.00'), None, 'IT'), (107, 'Diana', 'IT_PROG', 103, datetime.date(2007, 2, 7), Decimal('4200.00'), None, 'IT'), (108, 'Nancy', 'FI_MGR', 101, datetime.date(2002, 8, 17), Decimal('12008.00'), None, 'Finance'), (109, 'Daniel', 'FI_ACCOUNT', 108, datetime.date(2002, 8, 16), Decimal('9000.00'), None, 'Finance'), (110, 'John', 'FI_ACCOUNT', 108, datetime.date(2005, 9, 28), Decimal('8200.00'), None, 'Finance'), (111, 'Ismael', 'FI_ACCOUNT', 108, datetime.date(2005, 9, 30), Decimal('7700.00'), None, 'Finance'), (112, 'Jose Manuel', 'FI_ACCOUNT', 108, datetime.date(2006, 3, 7), Decimal('7800.00'), None, 'Finance'), (113, 'Luis', 'FI_ACCOUNT', 108, datetime.date(2007, 12, 7), Decimal('6900.00'), None, 'Finance'), (114, 'Den', 'PU_MAN', 100, datetime.date(2002, 12, 7), Decimal('11000.00'), None, 'Purchasing'), (115, 'Alexander', 'PU_MAN', 100, datetime.date(2003, 5, 18), Decimal('7100.00'), None, 'Purchasing'), (116, 'Shelli', 'PU_CLERK', 114, datetime.date(2005, 12, 24), Decimal('2900.00'), None, 'Purchasing'), (117, 'Sigal', 'PU_CLERK', 115, datetime.date(2005, 7, 24), Decimal('2800.00'), None, 'Purchasing'), (118, 'Guy', 'PU_CLERK', 115, datetime.date(2006, 11, 15), Decimal('2600.00'), None, 'Purchasing'), (119, 'Karen', 'PU_CLERK', 114, datetime.date(2007, 8, 10), Decimal('2500.00'), None, 'Purchasing'), (120, 'Matthew', 'ST_MAN', 100, datetime.date(2004, 7, 18), Decimal('8000.00'), None, 'Shipping'), (121, 'Adam', 'ST_MAN', 100, datetime.date(2005, 4, 10), Decimal('8200.00'), None, 'Shipping'), (122, 'Payam', 'ST_MAN', 100, datetime.date(2003, 5, 1), Decimal('7900.00'), None, 'Shipping'), (123, 'Shanta', 'ST_MAN', 100, datetime.date(2005, 10, 10), Decimal('6500.00'), None, 'Shipping'), (124, 'Kevin', 'ST_MAN', 100, datetime.date(2007, 11, 16), Decimal('5800.00'), None, 'Shipping'), (125, 'Julia', 'ST_CLERK', 120, datetime.date(2005, 7, 16), Decimal('3200.00'), None, 'Shipping'), (126, 'Irene', 'ST_CLERK', 120, datetime.date(2006, 9, 28), Decimal('2700.00'), None, 'Shipping'), (127, 'James', 'ST_CLERK', 120, datetime.date(2007, 1, 14), Decimal('2400.00'), None, 'Shipping'), (128, 'Steven', 'ST_CLERK', 120, datetime.date(2008, 3, 8), Decimal('2200.00'), None, 'Shipping'), (129, 'Laura', 'ST_CLERK', 121, datetime.date(2005, 8, 20), Decimal('3300.00'), None, 'Shipping'), (130, 'Mozhe', 'ST_CLERK', 121, datetime.date(2005, 10, 30), Decimal('2800.00'), None, 'Shipping'), (131, 'James', 'ST_CLERK', 121, datetime.date(2005, 2, 16), Decimal('2500.00'), None, 'Shipping'), (132, 'TJ', 'ST_CLERK', 121, datetime.date(2007, 4, 10), Decimal('2100.00'), None, 'Shipping'), (133, 'Jason', 'ST_CLERK', 122, datetime.date(2004, 6, 14), Decimal('3300.00'), None, 'Shipping'), (134, 'Michael', 'ST_CLERK', 122, datetime.date(2006, 8, 26), Decimal('2900.00'), None, 'Shipping'), (135, 'Ki', 'ST_CLERK', 122, datetime.date(2007, 12, 12), Decimal('2400.00'), None, 'Shipping'), (136, 'Hazel', 'ST_CLERK', 122, datetime.date(2008, 2, 6), Decimal('2200.00'), None, 'Shipping'), (137, 'Renske', 'ST_CLERK', 123, datetime.date(2003, 7, 14), Decimal('3600.00'), None, 'Shipping'), (138, 'Stephen', 'ST_CLERK', 123, datetime.date(2005, 10, 26), Decimal('3200.00'), None, 'Shipping'), (139, 'John', 'ST_CLERK', 123, datetime.date(2006, 2, 12), Decimal('2700.00'), None, 'Shipping'), (140, 'Joshua', 'ST_CLERK', 123, datetime.date(2006, 4, 6), Decimal('2500.00'), None, 'Shipping'), (141, 'Trenna', 'ST_CLERK', 124, datetime.date(2003, 10, 17), Decimal('3500.00'), None, 'Shipping'), (142, 'Curtis', 'ST_CLERK', 124, datetime.date(2005, 1, 29), Decimal('3100.00'), None, 'Shipping'), (143, 'Randall', 'ST_CLERK', 124, datetime.date(2006, 3, 15), Decimal('2600.00'), None, 'Shipping'), (144, 'Peter', 'ST_CLERK', 124, datetime.date(2006, 7, 9), Decimal('2500.00'), None, 'Shipping'), (145, 'John', 'SA_MAN', 100, datetime.date(2004, 10, 1), Decimal('14000.00'), Decimal('0.40'), 'Sales'), (146, 'Karen', 'SA_MAN', 100, datetime.date(2005, 1, 5), Decimal('13500.00'), Decimal('0.30'), 'Sales'), (147, 'Alberto', 'SA_MAN', 100, datetime.date(2005, 3, 10), Decimal('12000.00'), Decimal('0.30'), None), (148, 'Gerald', 'SA_MAN', 100, datetime.date(2007, 10, 15), Decimal('11000.00'), Decimal('0.30'), 'Sales'), (149, 'Eleni', 'SA_MAN', 100, datetime.date(2008, 1, 29), Decimal('10500.00'), Decimal('0.20'), 'Sales'), (150, 'Peter', 'SA_REP', 145, datetime.date(2005, 1, 30), Decimal('10000.00'), Decimal('0.30'), 'Sales'), (151, 'David', 'SA_REP', 145, datetime.date(2005, 3, 24), Decimal('9500.00'), Decimal('0.25'), 'Sales'), (152, 'Peter', 'SA_REP', 145, datetime.date(2005, 8, 20), Decimal('9000.00'), Decimal('0.25'), 'Sales'), (153, 'Christopher', 'SA_REP', 145, datetime.date(2006, 3, 30), Decimal('8000.00'), Decimal('0.20'), 'Sales'), (154, 'Nanette', 'SA_REP', 145, datetime.date(2006, 12, 9), Decimal('7500.00'), Decimal('0.20'), 'Sales'), (155, 'Oliver', 'SA_REP', 145, datetime.date(2007, 11, 23), Decimal('7000.00'), Decimal('0.15'), 'Sales'), (156, 'Janette', 'SA_REP', 146, datetime.date(2004, 1, 30), Decimal('10000.00'), Decimal('0.35'), 'Sales'), (157, 'Patrick', 'SA_REP', 146, datetime.date(2004, 3, 4), Decimal('9500.00'), Decimal('0.35'), 'Sales'), (158, 'Allan', 'SA_REP', 146, datetime.date(2004, 8, 1), Decimal('9000.00'), Decimal('0.35'), 'Sales'), (159, 'Lindsey', 'SA_REP', 146, datetime.date(2005, 3, 10), Decimal('8000.00'), Decimal('0.30'), 'Sales'), (160, 'Louise', 'SA_REP', 146, datetime.date(2005, 12, 15), Decimal('7500.00'), Decimal('0.30'), 'Sales'), (161, 'Sarath', 'SA_REP', 146, datetime.date(2006, 11, 3), Decimal('7000.00'), Decimal('0.25'), 'Sales'), (162, 'Clara', 'SA_REP', 147, datetime.date(2005, 11, 11), Decimal('10500.00'), Decimal('0.25'), 'Sales'), (163, 'Danielle', 'SA_REP', 147, datetime.date(2007, 3, 19), Decimal('9500.00'), Decimal('0.15'), 'Sales'), (164, 'Mattea', 'SA_REP', 147, datetime.date(2008, 1, 24), Decimal('7200.00'), Decimal('0.10'), 'Sales'), (165, 'David', 'SA_REP', 147, datetime.date(2008, 2, 23), Decimal('6800.00'), Decimal('0.10'), 'Sales'), (166, 'Sundar', 'SA_REP', 147, datetime.date(2008, 3, 24), Decimal('6400.00'), Decimal('0.10'), 'Sales'), (167, 'Amit', 'SA_REP', 147, datetime.date(2008, 4, 21), Decimal('6200.00'), Decimal('0.10'), 'Sales'), (168, 'Lisa', 'SA_REP', 148, datetime.date(2005, 3, 11), Decimal('11500.00'), Decimal('0.25'), 'Sales'), (169, 'Harrison', 'SA_REP', 148, datetime.date(2006, 3, 23), Decimal('10000.00'), Decimal('0.20'), 'Sales'), (170, 'Tayler', 'SA_REP', 148, datetime.date(2006, 1, 24), Decimal('9600.00'), Decimal('0.20'), 'Sales'), (171, 'William', 'SA_REP', 148, datetime.date(2007, 2, 23), Decimal('7400.00'), Decimal('0.15'), 'Sales'), (172, 'Elizabeth', 'SA_REP', 148, datetime.date(2007, 3, 24), Decimal('7300.00'), Decimal('0.15'), 'Sales'), (173, 'Sundita', 'SA_REP', 148, datetime.date(2008, 4, 21), Decimal('6100.00'), Decimal('0.10'), 'Sales'), (174, 'Ellen', 'SA_REP', 149, datetime.date(2004, 5, 11), Decimal('11000.00'), Decimal('0.30'), 'Sales'), (175, 'Alyssa', 'SA_REP', 149, datetime.date(2005, 3, 19), Decimal('8800.00'), Decimal('0.25'), 'Sales'), (176, 'Jonathon', 'SA_REP', 149, datetime.date(2006, 3, 24), Decimal('8600.00'), Decimal('0.20'), 'Sales'), (177, 'Jack', 'SA_REP', 149, datetime.date(2006, 4, 23), Decimal('8400.00'), Decimal('0.20'), 'Sales'), (178, 'Kimberely', 'SA_REP', 149, datetime.date(2007, 5, 24), Decimal('7000.00'), Decimal('0.15'), None), (179, 'Charles', 'SA_REP', 149, datetime.date(2008, 1, 4), Decimal('6200.00'), Decimal('0.10'), 'Sales'), (180, 'Winston', 'SH_CLERK', 120, datetime.date(2006, 1, 24), Decimal('3200.00'), None, 'Shipping'), (181, 'Jean', 'SH_CLERK', 120, datetime.date(2006, 2, 23), Decimal('3100.00'), None, 'Shipping'), (182, 'Martha', 'SH_CLERK', 120, datetime.date(2007, 6, 21), Decimal('2500.00'), None, 'Shipping'), (183, 'Girard', 'SH_CLERK', 120, datetime.date(2008, 2, 3), Decimal('2800.00'), None, 'Shipping'), (184, 'Nandita', 'SH_CLERK', 121, datetime.date(2004, 1, 27), Decimal('4200.00'), None, 'Shipping'), (185, 'Alexis', 'SH_CLERK', 121, datetime.date(2005, 2, 20), Decimal('4100.00'), None, 'Shipping'), (186, 'Julia', 'SH_CLERK', 121, datetime.date(2006, 6, 24), Decimal('3400.00'), None, 'Shipping'), (187, 'Anthony', 'SH_CLERK', 121, datetime.date(2007, 2, 7), Decimal('3000.00'), None, 'Shipping'), (188, 'Kelly', 'SH_CLERK', 122, datetime.date(2005, 6, 14), Decimal('3800.00'), None, 'Shipping'), (189, 'Jennifer', 'SH_CLERK', 122, datetime.date(2005, 8, 13), Decimal('3600.00'), None, 'Shipping'), (190, 'Timothy', 'SH_CLERK', 122, datetime.date(2006, 7, 11), Decimal('2900.00'), None, 'Shipping'), (191, 'Randall', 'SH_CLERK', 122, datetime.date(2007, 12, 19), Decimal('2500.00'), None, 'Shipping'), (192, 'Sarah', 'SH_CLERK', 123, datetime.date(2004, 2, 4), Decimal('4000.00'), None, 'Shipping'), (193, 'Britney', 'SH_CLERK', 123, datetime.date(2005, 3, 3), Decimal('3900.00'), None, 'Shipping'), (194, 'Samuel', 'SH_CLERK', 123, datetime.date(2006, 7, 1), Decimal('3200.00'), None, 'Shipping'), (195, 'Vance', 'SH_CLERK', 123, datetime.date(2007, 3, 17), Decimal('2800.00'), None, 'Shipping'), (196, 'Alana', 'SH_CLERK', 124, datetime.date(2006, 4, 24), Decimal('3100.00'), None, None), (197, 'Kevin', 'SH_CLERK', 124, datetime.date(2006, 5, 23), Decimal('3000.00'), None, 'Shipping'), (198, 'Donald', 'SH_CLERK', 124, datetime.date(2007, 6, 21), Decimal('2600.00'), None, 'Shipping'), (199, 'Douglas', 'SH_CLERK', 124, datetime.date(2008, 1, 13), Decimal('2600.00'), None, 'Shipping'), (200, 'Jenni%fer', 'AD_ASST', 101, datetime.date(2003, 9, 17), Decimal('4400.00'), None, 'Administration'), (201, 'Michael', 'MK_MAN', 100, datetime.date(2004, 2, 17), Decimal('13000.00'), None, 'Marketing'), (202, 'Pat', 'MK_REP', 201, datetime.date(2005, 8, 17), Decimal('6000.00'), None, 'Marketing'), (203, 'Susan', 'HR_REP', 101, datetime.date(2002, 6, 7), Decimal('6500.00'), None, 'Human Resources'), (206, '월리암', '회계', 205, datetime.date(2002, 6, 7), Decimal('18300.00'), None, 'Accounting'), (300, '홍길동', 'AC_ACCOUNT', 205, datetime.date(2022, 5, 31), Decimal('4000.00'), None, 'Accounting'), (302, '강감찬', 'AC_ACCOUNT', 205, datetime.date(2020, 1, 3), Decimal('10000.00'), None, None), (303, '이순신', 'AC_ACCOUNT', 205, datetime.date(2020, 1, 3), Decimal('10000.00'), Decimal('0.10'), None), (305, '홍길동', '기획부', 100, datetime.date(2001, 1, 1), Decimal('10000.00'), None, '기획'))

In [ ]:
# emp_id 를 매개변수로 받아서 그 직원 정보를 조회한 결과를 반환하는 메소드

In [5]:
import pymysql
def select_emp_id_emp(emp_id):
    sql = "select * from emp where emp_id = %s"
    with pymysql.connect(host='127.0.0.1',port=3306,user='scott',password='tiger',db='hr',charset='utf8') as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql,(emp_id))
            result = cursor.fetchall()
            return result

In [6]:
select_emp_id_emp(401)

((401,
  '홍길동',
  '기획',
  100,
  datetime.date(2020, 10, 10),
  Decimal('3000.00'),
  Decimal('0.20'),
  '기획부'),)

In [ ]:
# dept_name을 매개변수로 받아서 그 부서의 직원들을 조회한 결과를 반환하는 메소드

In [105]:
def select_dept_name(dept_name):
    sql = "select * from emp where dept_name = %s"
    with pymysql.connect(host='127.0.0.1',port=3306,user='scott',password='tiger',db='hr',charset='utf8') as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql,(dept_name))
            result = cursor.fetchall()
            return result

In [106]:
select_dept_name('Shipping')

((120,
  'Matthew',
  'ST_MAN',
  100,
  datetime.date(2004, 7, 18),
  Decimal('8000.00'),
  None,
  'Shipping'),
 (121,
  'Adam',
  'ST_MAN',
  100,
  datetime.date(2005, 4, 10),
  Decimal('8200.00'),
  None,
  'Shipping'),
 (122,
  'Payam',
  'ST_MAN',
  100,
  datetime.date(2003, 5, 1),
  Decimal('7900.00'),
  None,
  'Shipping'),
 (123,
  'Shanta',
  'ST_MAN',
  100,
  datetime.date(2005, 10, 10),
  Decimal('6500.00'),
  None,
  'Shipping'),
 (124,
  'Kevin',
  'ST_MAN',
  100,
  datetime.date(2007, 11, 16),
  Decimal('5800.00'),
  None,
  'Shipping'),
 (125,
  'Julia',
  'ST_CLERK',
  120,
  datetime.date(2005, 7, 16),
  Decimal('3200.00'),
  None,
  'Shipping'),
 (126,
  'Irene',
  'ST_CLERK',
  120,
  datetime.date(2006, 9, 28),
  Decimal('2700.00'),
  None,
  'Shipping'),
 (127,
  'James',
  'ST_CLERK',
  120,
  datetime.date(2007, 1, 14),
  Decimal('2400.00'),
  None,
  'Shipping'),
 (128,
  'Steven',
  'ST_CLERK',
  120,
  datetime.date(2008, 3, 8),
  Decimal('2200.00'),
  None,
  'Shipping'),
 (129,
  'Laura',
  'ST_CLERK',
  121,
  datetime.date(2005, 8, 20),
  Decimal('3300.00'),
  None,
  'Shipping'),
 (130,
  'Mozhe',
  'ST_CLERK',
  121,
  datetime.date(2005, 10, 30),
  Decimal('2800.00'),
  None,
  'Shipping'),
 (131,
  'James',
  'ST_CLERK',
  121,
  datetime.date(2005, 2, 16),
  Decimal('2500.00'),
  None,
  'Shipping'),
 (132,
  'TJ',
  'ST_CLERK',
  121,
  datetime.date(2007, 4, 10),
  Decimal('2100.00'),
  None,
  'Shipping'),
 (133,
  'Jason',
  'ST_CLERK',
  122,
  datetime.date(2004, 6, 14),
  Decimal('3300.00'),
  None,
  'Shipping'),
 (134,
  'Michael',
  'ST_CLERK',
  122,
  datetime.date(2006, 8, 26),
  Decimal('2900.00'),
  None,
  'Shipping'),
 (135,
  'Ki',
  'ST_CLERK',
  122,
  datetime.date(2007, 12, 12),
  Decimal('2400.00'),
  None,
  'Shipping'),
 (136,
  'Hazel',
  'ST_CLERK',
  122,
  datetime.date(2008, 2, 6),
  Decimal('2200.00'),
  None,
  'Shipping'),
 (137,
  'Renske',
  'ST_CLERK',
  123,
  datetime.date(2003, 7, 14),
  Decimal('3600.00'),
  None,
  'Shipping'),
 (138,
  'Stephen',
  'ST_CLERK',
  123,
  datetime.date(2005, 10, 26),
  Decimal('3200.00'),
  None,
  'Shipping'),
 (139,
  'John',
  'ST_CLERK',
  123,
  datetime.date(2006, 2, 12),
  Decimal('2700.00'),
  None,
  'Shipping'),
 (140,
  'Joshua',
  'ST_CLERK',
  123,
  datetime.date(2006, 4, 6),
  Decimal('2500.00'),
  None,
  'Shipping'),
 (141,
  'Trenna',
  'ST_CLERK',
  124,
  datetime.date(2003, 10, 17),
  Decimal('3500.00'),
  None,
  'Shipping'),
 (142,
  'Curtis',
  'ST_CLERK',
  124,
  datetime.date(2005, 1, 29),
  Decimal('3100.00'),
  None,
  'Shipping'),
 (143,
  'Randall',
  'ST_CLERK',
  124,
  datetime.date(2006, 3, 15),
  Decimal('2600.00'),
  None,
  'Shipping'),
 (144,
  'Peter',
  'ST_CLERK',
  124,
  datetime.date(2006, 7, 9),
  Decimal('2500.00'),
  None,
  'Shipping'),
 (180,
  'Winston',
  'SH_CLERK',
  120,
  datetime.date(2006, 1, 24),
  Decimal('3200.00'),
  None,
  'Shipping'),
 (181,
  'Jean',
  'SH_CLERK',
  120,
  datetime.date(2006, 2, 23),
  Decimal('3100.00'),
  None,
  'Shipping'),
 (182,
  'Martha',
  'SH_CLERK',
  120,
  datetime.date(2007, 6, 21),
  Decimal('2500.00'),
  None,
  'Shipping'),
 (183,
  'Girard',
  'SH_CLERK',
  120,
  datetime.date(2008, 2, 3),
  Decimal('2800.00'),
  None,
  'Shipping'),
 (184,
  'Nandita',
  'SH_CLERK',
  121,
  datetime.date(2004, 1, 27),
  Decimal('4200.00'),
  None,
  'Shipping'),
 (185,
  'Alexis',
  'SH_CLERK',
  121,
  datetime.date(2005, 2, 20),
  Decimal('4100.00'),
  None,
  'Shipping'),
 (186,
  'Julia',
  'SH_CLERK',
  121,
  datetime.date(2006, 6, 24),
  Decimal('3400.00'),
  None,
  'Shipping'),
 (187,
  'Anthony',
  'SH_CLERK',
  121,
  datetime.date(2007, 2, 7),
  Decimal('3000.00'),
  None,
  'Shipping'),
 (188,
  'Kelly',
  'SH_CLERK',
  122,
  datetime.date(2005, 6, 14),
  Decimal('3800.00'),
  None,
  'Shipping'),
 (189,
  'Jennifer',
  'SH_CLERK',
  122,
  datetime.date(2005, 8, 13),
  Decimal('3600.00'),
  None,
  'Shipping'),
 (190,
  'Timothy',
  'SH_CLERK',
  122,
  datetime.date(2006, 7, 11),
  Decimal('2900.00'),
  None,
  'Shipping'),
 (191,
  'Randall',
  'SH_CLERK',
  122,
  datetime.date(2007, 12, 19),
  Decimal('2500.00'),
  None,
  'Shipping'),
 (192,
  'Sarah',
  'SH_CLERK',
  123,
  datetime.date(2004, 2, 4),
  Decimal('4000.00'),
  None,
  'Shipping'),
 (193,
  'Britney',
  'SH_CLERK',
  123,
  datetime.date(2005, 3, 3),
  Decimal('3900.00'),
  None,
  'Shipping'),
 (194,
  'Samuel',
  'SH_CLERK',
  123,
  datetime.date(2006, 7, 1),
  Decimal('3200.00'),
  None,
  'Shipping'),
 (195,
  'Vance',
  'SH_CLERK',
  123,
  datetime.date(2007, 3, 17),
  Decimal('2800.00'),
  None,
  'Shipping'),
 (197,
  'Kevin',
  'SH_CLERK',
  124,
  datetime.date(2006, 5, 23),
  Decimal('3000.00'),
  None,
  'Shipping'),
 (198,
  'Donald',
  'SH_CLERK',
  124,
  datetime.date(2007, 6, 21),
  Decimal('2600.00'),
  None,
  'Shipping'),
 (199,
  'Douglas',
  'SH_CLERK',
  124,
  datetime.date(2008, 1, 13),
  Decimal('2600.00'),
  None,
  'Shipping'))

In [ ]:
# salary 범위를 받아서 그 범위의 salary를 받는 직원들을 조회한 결과를 반환하는 함수

In [108]:
def select_salary(min_salary, max_salary):
    sql = "select * from emp where salary between %s and %s"
    with pymysql.connect(host='127.0.0.1',port=3306,user='scott',password='tiger',db='hr',charset='utf8') as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql,(min_salary,max_salary))
            result = cursor.fetchall()
            return result

In [109]:
select_salary(3000, 4000)

((125,
  'Julia',
  'ST_CLERK',
  120,
  datetime.date(2005, 7, 16),
  Decimal('3200.00'),
  None,
  'Shipping'),
 (129,
  'Laura',
  'ST_CLERK',
  121,
  datetime.date(2005, 8, 20),
  Decimal('3300.00'),
  None,
  'Shipping'),
 (133,
  'Jason',
  'ST_CLERK',
  122,
  datetime.date(2004, 6, 14),
  Decimal('3300.00'),
  None,
  'Shipping'),
 (137,
  'Renske',
  'ST_CLERK',
  123,
  datetime.date(2003, 7, 14),
  Decimal('3600.00'),
  None,
  'Shipping'),
 (138,
  'Stephen',
  'ST_CLERK',
  123,
  datetime.date(2005, 10, 26),
  Decimal('3200.00'),
  None,
  'Shipping'),
 (141,
  'Trenna',
  'ST_CLERK',
  124,
  datetime.date(2003, 10, 17),
  Decimal('3500.00'),
  None,
  'Shipping'),
 (142,
  'Curtis',
  'ST_CLERK',
  124,
  datetime.date(2005, 1, 29),
  Decimal('3100.00'),
  None,
  'Shipping'),
 (180,
  'Winston',
  'SH_CLERK',
  120,
  datetime.date(2006, 1, 24),
  Decimal('3200.00'),
  None,
  'Shipping'),
 (181,
  'Jean',
  'SH_CLERK',
  120,
  datetime.date(2006, 2, 23),
  Decimal('3100.00'),
  None,
  'Shipping'),
 (186,
  'Julia',
  'SH_CLERK',
  121,
  datetime.date(2006, 6, 24),
  Decimal('3400.00'),
  None,
  'Shipping'),
 (187,
  'Anthony',
  'SH_CLERK',
  121,
  datetime.date(2007, 2, 7),
  Decimal('3000.00'),
  None,
  'Shipping'),
 (188,
  'Kelly',
  'SH_CLERK',
  122,
  datetime.date(2005, 6, 14),
  Decimal('3800.00'),
  None,
  'Shipping'),
 (189,
  'Jennifer',
  'SH_CLERK',
  122,
  datetime.date(2005, 8, 13),
  Decimal('3600.00'),
  None,
  'Shipping'),
 (192,
  'Sarah',
  'SH_CLERK',
  123,
  datetime.date(2004, 2, 4),
  Decimal('4000.00'),
  None,
  'Shipping'),
 (193,
  'Britney',
  'SH_CLERK',
  123,
  datetime.date(2005, 3, 3),
  Decimal('3900.00'),
  None,
  'Shipping'),
 (194,
  'Samuel',
  'SH_CLERK',
  123,
  datetime.date(2006, 7, 1),
  Decimal('3200.00'),
  None,
  'Shipping'),
 (196,
  'Alana',
  'SH_CLERK',
  124,
  datetime.date(2006, 4, 24),
  Decimal('3100.00'),
  None,
  None),
 (197,
  'Kevin',
  'SH_CLERK',
  124,
  datetime.date(2006, 5, 23),
  Decimal('3000.00'),
  None,
  'Shipping'),
 (300,
  '홍길동',
  'AC_ACCOUNT',
  205,
  datetime.date(2022, 5, 31),
  Decimal('4000.00'),
  None,
  'Accounting'),
 (401,
  '홍길동',
  '기획',
  100,
  datetime.date(2020, 10, 10),
  Decimal('3000.00'),
  Decimal('0.20'),
  '기획부'),
 (402,
  '홍길동',
  '기획',
  100,
  datetime.date(2020, 10, 10),
  Decimal('3000.00'),
  Decimal('0.20'),
  '기획부'),
 (403,
  '홍길동',
  '기획',
  100,
  datetime.date(2020, 10, 10),
  Decimal('3000.00'),
  Decimal('0.20'),
  '기획부'))

In [ ]:
# dept_name을 매개변수로 받아서 부서별 급여 통계정보(합계, 평균, 최대, 최소)를 반환하는 함수

In [118]:
def select_deft_name_salary(dept_name):
    sql = "select max(salary) 최대, min(salary) 최소, avg(salary) 평균, sum(salary) 합계 from emp where dept_name = %s"
    with pymysql.connect(host='127.0.0.1',port=3306,user='scott',password='tiger',db='hr',charset='utf8',
                        cursorclass=pymysql.cursors.DictCursor) as connection:
        with connection.cursor() as cursor:
            cursor.execute(sql,(dept_name))
            result = cursor.fetchall()
            return result

In [119]:
select_deft_name_salary('IT')

[{'최대': Decimal('9000.00'),
  '최소': Decimal('4200.00'),
  '평균': Decimal('5760.000000'),
  '합계': Decimal('28800.00')}]